# Doc: https://github.com/Homebrew/homebrew-bundle

# General config
#cask_args appdir: "~/Applications", require_sha: true

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"

# Command line tools
cask "kitty"
brew "awscli"
brew "aws-iam-authenticator"
brew "bat"
brew "eza"
brew "zoxide"
brew "tmux"
brew "zellij"
brew "jq"
brew "yq"
brew "fzf"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
tap "jandedobbeleer/oh-my-posh"
brew "btop"
brew "wget"
brew "rg"
brew "lazygit"
brew "lazydocker"
brew "ripgrep"
brew "yazi"
brew "sshpass"

# System
cask "utm", args: { }
cask "aws-vpn-client", args: { }

# Coding
brew "git"
brew "go"
brew "node"
brew "neovim"
brew "k6"
brew "ipython"
brew "gh"
brew "act"
brew "go-jsonnet"
brew "jsonnet-bundler"
brew "virtualenv"
brew "pyenv"

# Kubernetes
brew "kubernetes-cli"
brew "kube-ps1"
brew "kubectx"
brew "k9s"
brew "kind"
brew "helm"
brew "kustomize"
brew "glooctl"
brew "pixie"
tap "fluxcd/tap"
brew "fluxcd/tap/flux@2.2"

# IaC
brew "opentofu"
tap "hashicorp/tap"
brew "hashicorp/tap/terraform"

# Security
brew "nmap"
brew "exploitdb"
brew "trivy"
cask "burp-suite", args: { }
cask "wireshark", args: { }
brew "gpg"

# Utils
brew "qpdf"

# Desktop apps
# https://github.com/Homebrew/homebrew-cask/tree/master/Casks
cask "firefox", args: { }
cask "librewolf", args: { }
cask "spotify", args: { }
cask "slack", args: { }
cask "visual-studio-code", args: { }
cask "docker", args: { }
cask "scroll-reverser", args: { }
cask "megasync", args: { }
cask "google-chrome", args: { }
cask "httpie", args: { }
