# Doc: https://github.com/Homebrew/homebrew-bundle

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mas-cli/tap"
tap "aws/tap"

brew "k6"
brew "mas"
brew "awscli"
brew "aws-sam-cli"
brew "bat"
brew "exa"
brew "helm"
brew "htop"
brew "jq"
brew "k3d"
brew "k9s"
brew "kubernetes-cli"
brew "kube-ps1"
brew "kubectx"
brew "minikube"
brew "terraform"
brew "terraform-ls"
brew "tfswitch"
brew "vault"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "lynx"
brew "tmux"
brew "pkg-config", link: true
brew "bash"
brew "git"
brew "trivy"
brew "argocd"
brew "socat"

cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "multipass"
cask "firefox", args: { appdir: "~/my-apps/Applications" }
cask "google-chrome", args: { appdir: "~/my-apps/Applications" }
cask "slack", args: { appdir: "~/my-apps/Applications" }
cask "iterm2", args: { appdir: "~/my-apps/Applications" }
cask "bitwarden"
cask "spotify", args: { appdir: "~/my-apps/Applications" }
cask "visual-studio-code", args: { appdir: "~/my-apps/Applications" }
cask "metasploit"
cask "multipass"

#mas "com.apple.dt.Xcode", id: 497799835
