# Doc: https://github.com/Homebrew/homebrew-bundle

# General config
#cask_args appdir: "~/Applications", require_sha: true

# Fonts
tap "homebrew/cask-fonts"
cask "font-jetbrains-mono-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"

# Command line tools
cask "alacritty"
brew "awscli"
brew "aws-iam-authenticator"
brew "bat"
brew "eza"
brew "zoxide"
brew "tmux"
brew "zellij"
brew "jq"
brew "fzf"
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "font-meslo-for-powerlevel10k"
brew "htop"
brew "btop"
cask "ollama"
brew "wget"
brew "rg"
brew "lazygit"

# System
cask "utm", args: { }
cask "aws-vpn-client", args: { }

# Coding
brew "git"
brew "go"
brew "node"
brew "neovim"
brew "k6"
brew "ipython"
brew "gh"

# Kubernetes
brew "kubernetes-cli"
brew "kube-ps1"
brew "kubectx"
brew "k9s"
brew "kind"
brew "helm"
brew "kustomize"
brew "glooctl"
brew "pixie"

# IaC
brew "terraform"
brew "opentofu"

# Security
brew "nmap"
brew "exploitdb"
brew "trivy"
cask "burp-suite", args: { }
cask "wireshark", args: { }
brew "gpg"
brew "gpg"


# Desktop apps
# https://github.com/Homebrew/homebrew-cask/tree/master/Casks
cask "firefox", args: { }
cask "slack", args: { }
cask "visual-studio-code", args: { }
cask "docker", args: { }
cask "scroll-reverser", args: { }
cask "megasync", args: { }
cask "google-chrome", args: { }
cask "httpie", args: { }
cask "skitch", args: { }
